app/views/static_pages/accessories.html.erb

<h1>StaticPages#accessories</h1>
<% Post.where(category_id: 4).each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY "posts"."created_at" DESC  [["category_id", 4]]