app/views/static_pages/kids_item.html.erb

<h1>StaticPages#kids_item</h1>
<% Post.where(category_id: 2).each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY "posts"."created_at" DESC  [["category_id", 2]]