app/views/static_pages/parts.html.erb

<h1>StaticPages#parts</h1>
<% Post.where(category_id: 3).each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY "posts"."created_at" DESC  [["category_id", 3]]