app/controllers/static_pages_controller.rb

  def bikes
  	@posts = Post.where(category_id: 1)
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY "posts"."created_at" DESC  [["category_id", 1]]

  def kids_item
  	@posts = Post.where(category_id: 2)
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY "posts"."created_at" DESC  [["category_id", 2]]

  def parts
  	@posts = Post.where(category_id: 3)
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY "posts"."created_at" DESC  [["category_id", 3]]

  def accessories
  	@posts = Post.where(category_id: 4)
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY "posts"."created_at" DESC  [["category_id", 4]]